Revit 2026 API

# CameraEyePosition Property

---

Camera's position in the world

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ EyePosition { get; set; }
```
```vb
Public Property EyePosition As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ EyePosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member EyePosition : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Camera Class

Autodesk.Revit.DB.DirectContext3D Namespace